fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Documents/ВКМ_ВыплатаЗарплаты/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяКоманды = "ЗаполнитьСотрудников";
	КомандаЗаполнения = Команды.Добавить(ИмяКоманды);
	КомандаЗаполнения.Действие  = "ЗаполнитьСотрудниковНаКлиенте";
	КомандаЗаполнения.Заголовок = "Заполнить сотрудников";
	
	ЭлементПанель = Элементы.ВыплатыКоманднаяПанель; 
	НоваяКнопка = Элементы.Добавить("КнопкаЗаполнитьСотрудников", Тип("КнопкаФормы"), ЭлементПанель);
	НоваяКнопка.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗаполнитьСотрудниковНаКлиенте(Команда) Экспорт
	ЗаполнитьСотрудниковНаСервере();
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьСотрудниковНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВзаиморасчетыОстатки.Сотрудник КАК Сотрудник,
		|	ЕСТЬNULL(ВзаиморасчетыОстатки.СуммаОстаток, 0) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Бесконечность, ) КАК ВзаиморасчетыОстатки
		|ГДЕ
		|	ВзаиморасчетыОстатки.СуммаОстаток > 0";

	КонецВремен = Дата(3999, 12, 31, 23, 59, 59);
	Запрос.УстановитьПараметр("Бесконечность", Новый Граница(КонецВремен, ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Выплаты.Очистить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрока = Объект.Выплаты.Добавить();
			НоваяСтрока.Сотрудник = Выборка.Сотрудник;
			НоваяСтрока.Сумма     = Выборка.СуммаОстаток;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти
